rpcme/aws-mikroe-smarthome-pic32mz/smarthome-kit/microchip/harmony/v2.05/framework/peripheral/dma/processor/dma_p32mz2048efh124.h
PLIB_INLINE_API bool PLIB_DMA_ExistsChannelXAuto(DMA_MODULE_ID index)
{
     return DMA_ExistsChannelXAuto_Default(index);
}

PLIB_INLINE_API void PLIB_DMA_ChannelXAutoEnable(DMA_MODULE_ID index, DMA_CHANNEL channel)
{
     DMA_ChannelXAutoEnable_Default(index, channel);
}

PLIB_INLINE_API void PLIB_DMA_ChannelXAutoDisable(DMA_MODULE_ID index, DMA_CHANNEL channel)
{
     DMA_ChannelXAutoDisable_Default(index, channel);
}

PLIB_INLINE_API bool PLIB_DMA_ChannelXAutoIsEnabled(DMA_MODULE_ID index, DMA_CHANNEL channel)
{
     return DMA_ChannelXAutoIsEnabled_Default(index, channel);
}

PLIB_INLINE_API bool PLIB_DMA_ExistsChannelXChainEnbl(DMA_MODULE_ID index)
{
     return DMA_ExistsChannelXChainEnbl_Default(index);
}

PLIB_INLINE_API void PLIB_DMA_ChannelXChainEnable(DMA_MODULE_ID index, DMA_CHANNEL channel)
{
     DMA_ChannelXChainEnable_Default(index, channel);
}

PLIB_INLINE_API void PLIB_DMA_ChannelXChainDisable(DMA_MODULE_ID index, DMA_CHANNEL channel)
{
     DMA_ChannelXChainDisable_Default(index, channel);
}

PLIB_INLINE_API bool PLIB_DMA_ChannelXChainIsEnabled(DMA_MODULE_ID index, DMA_CHANNEL channel)
{
     return DMA_ChannelXChainIsEnabled_Default(index, channel);
}

PLIB_INLINE_API bool PLIB_DMA_ExistsChannelXDisabled(DMA_MODULE_ID index)
{
     return DMA_ExistsChannelXDisabled_Default(index);
}

PLIB_INLINE_API void PLIB_DMA_ChannelXDisabledEnablesEvents(DMA_MODULE_ID index, DMA_CHANNEL channel)
{
     DMA_ChannelXDisabledEnablesEvents_Default(index, channel);
}

PLIB_INLINE_API void PLIB_DMA_ChannelXDisabledDisablesEvents(DMA_MODULE_ID index, DMA_CHANNEL channel)
{
     DMA_ChannelXDisabledDisablesEvents_Default(index, channel);
}

PLIB_INLINE_API bool PLIB_DMA_ExistsChannelX(DMA_MODULE_ID index)
{
     return DMA_ExistsChannelX_Default(index);
}

PLIB_INLINE_API void PLIB_DMA_ChannelXEnable(DMA_MODULE_ID index, DMA_CHANNEL channel)
{
     DMA_ChannelXEnable_Default(index, channel);
}

PLIB_INLINE_API bool PLIB_DMA_ChannelXIsEnabled(DMA_MODULE_ID index, DMA_CHANNEL channel)
{
     return DMA_ChannelXIsEnabled_Default(index, channel);
}

PLIB_INLINE_API void PLIB_DMA_ChannelXDisable(DMA_MODULE_ID index, DMA_CHANNEL channel)
{
     DMA_ChannelXDisable_Default(index, channel);
}

PLIB_INLINE_API bool PLIB_DMA_ExistsChannelXChain(DMA_MODULE_ID index)
{
     return DMA_ExistsChannelXChain_Default(index);
}

PLIB_INLINE_API void PLIB_DMA_ChannelXChainToLower(DMA_MODULE_ID index, DMA_CHANNEL channel)
{
     DMA_ChannelXChainToLower_Default(index, channel);
}

PLIB_INLINE_API void PLIB_DMA_ChannelXChainToHigher(DMA_MODULE_ID index, DMA_CHANNEL channel)
{
     DMA_ChannelXChainToHigher_Default(index, channel);
}

PLIB_INLINE_API bool PLIB_DMA_ExistsChannelXPatternLength(DMA_MODULE_ID index)
{
     return DMA_ExistsChannelXPatternLength_Default(index);
}

PLIB_INLINE_API void PLIB_DMA_ChannelXPatternLengthSet(DMA_MODULE_ID index, DMA_CHANNEL dmaChannel, DMA_PATTERN_LENGTH patternLen)
{
     DMA_ChannelXPatternLengthSet_Default(index, dmaChannel, patternLen);
}

PLIB_INLINE_API DMA_PATTERN_LENGTH PLIB_DMA_ChannelXPatternLengthGet(DMA_MODULE_ID index, DMA_CHANNEL dmaChannel)
{
     return DMA_ChannelXPatternLengthGet_Default(index, dmaChannel);
}

PLIB_INLINE_API bool PLIB_DMA_ExistsChannelXPatternIgnoreByte(DMA_MODULE_ID index)
{
     return DMA_ExistsChannelXPatternIgnoreByte_Default(index);
}

PLIB_INLINE_API void PLIB_DMA_ChannelXPatternIgnoreByteEnable(DMA_MODULE_ID index, DMA_CHANNEL channel)
{
     DMA_ChannelXPatternIgnoreByteEnable_Default(index, channel);
}

PLIB_INLINE_API bool PLIB_DMA_ChannelXPatternIgnoreByteIsEnabled(DMA_MODULE_ID index, DMA_CHANNEL channel)
{
     return DMA_ChannelXPatternIgnoreByteIsEnabled_Default(index, channel);
}

PLIB_INLINE_API void PLIB_DMA_ChannelXPatternIgnoreByteDisable(DMA_MODULE_ID index, DMA_CHANNEL channel)
{
     DMA_ChannelXPatternIgnoreByteDisable_Default(index, channel);
}

PLIB_INLINE_API bool PLIB_DMA_ExistsChannelXBusy(DMA_MODULE_ID index)
{
     return DMA_ExistsChannelXBusy_Default(index);
}

PLIB_INLINE_API void PLIB_DMA_ChannelXBusyActiveSet(DMA_MODULE_ID index, DMA_CHANNEL channel)
{
     DMA_ChannelXBusyActiveSet_Default(index, channel);
}

PLIB_INLINE_API void PLIB_DMA_ChannelXBusyInActiveSet(DMA_MODULE_ID index, DMA_CHANNEL channel)
{
     DMA_ChannelXBusyInActiveSet_Default(index, channel);
}

PLIB_INLINE_API bool PLIB_DMA_ChannelXBusyIsBusy(DMA_MODULE_ID index, DMA_CHANNEL channel)
{
     return DMA_ChannelXBusyIsBusy_Default(index, channel);
}

PLIB_INLINE_API bool PLIB_DMA_ExistsChannelXPatternIgnore(DMA_MODULE_ID index)
{
     return DMA_ExistsChannelXPatternIgnore_Default(index);
}

PLIB_INLINE_API void PLIB_DMA_ChannelXPatternIgnoreSet(DMA_MODULE_ID index, DMA_CHANNEL channel, uint8_t pattern)
{
     DMA_ChannelXPatternIgnoreSet_Default(index, channel, pattern);
}

PLIB_INLINE_API uint8_t PLIB_DMA_ChannelXPatternIgnoreGet(DMA_MODULE_ID index, DMA_CHANNEL channel)
{
     return DMA_ChannelXPatternIgnoreGet_Default(index, channel);
}

PLIB_INLINE_API bool PLIB_DMA_ExistsChannelXTrigger(DMA_MODULE_ID index)
{
     return DMA_ExistsChannelXTrigger_Default(index);
}

PLIB_INLINE_API void PLIB_DMA_ChannelXTriggerEnable(DMA_MODULE_ID index, DMA_CHANNEL channel, DMA_CHANNEL_TRIGGER_TYPE trigger)
{
     DMA_ChannelXTriggerEnable_Default(index, channel, trigger);
}

PLIB_INLINE_API bool PLIB_DMA_ChannelXTriggerIsEnabled(DMA_MODULE_ID index, DMA_CHANNEL channel, DMA_CHANNEL_TRIGGER_TYPE trigger)
{
     return DMA_ChannelXTriggerIsEnabled_Default(index, channel, trigger);
}

PLIB_INLINE_API void PLIB_DMA_ChannelXTriggerDisable(DMA_MODULE_ID index, DMA_CHANNEL channel, DMA_CHANNEL_TRIGGER_TYPE trigger)
{
     DMA_ChannelXTriggerDisable_Default(index, channel, trigger);
}

PLIB_INLINE_API DMA_CHANNEL_INT_SOURCE PLIB_DMA_ChannelXTriggerSourceNumberGet(DMA_MODULE_ID index, DMA_CHANNEL channel)
{
     return DMA_ChannelXTriggerSourceNumberGet_Default(index, channel);
}

PLIB_INLINE_API bool PLIB_DMA_ExistsAbortTransfer(DMA_MODULE_ID index)
{
     return DMA_ExistsAbortTransfer_Default(index);
}

